change_map = {
    # Основные персонажи
    "Гарри Поттер": "Иван-царевич",
    "Гермиона Грейнджер": "Василиса Премудрая",
    "Рон Уизли": "Емеля",
    "Альбус Дамблдор": "Морозко",
    "Северус Снегг": "Кощей Бессмертный",
    "Лорд Волдеморт": "Змей Горыныч",
    # Семейство Малфоев и Пожиратели смерти
    "Драко Малфой": "Соловей-Разбойник",
    "Люциус Малфой": "Чернобог",
    "Нарцисса Малфой": "Мачеха",
    "Беллатриса Лестрейндж": "Баба-Яга",
    # Мародеры
    "Сириус Блэк": "Серый Волк",
    "Римус Люпин": "Волк-оборотень",
    "Питер Петтигрю": "Крыса-предатель",
    "Джеймс Поттер": "Царь-отец",
    "Лили Поттер": "Царица-мать",
    # Домашние эльфы и магические существа
    "Добби": "Домовой",
    "Кикимер": "Кикимора",
    "Дементоры": "Черные духи",
    "Фоукс": "Жар-птица",
    # Преподаватели и администрация
    "Рубеус Хагрид": "Лесовик",
    "Минерва МакГонагалл": "Премудрая старица",
    "Долорес Амбридж": "Ведьма",
    # Министерство магии
    "Корнелиус Фадж": "Царь-горох",
    "Кингсли Бруствер": "Премудрый царь",
    # Ученики
    "Невилл Долгопупс": "Иван-дурак",
    "Луна Лавгуд": "Жар-птица",
    "Пэнси Паркинсон": "Злая царевна",
    "Винсент Крэбб": "Горе-богатырь",
    "Грегори Гойл": "Глупец",
    # Злодеи и темные волшебники
    "Фенрир Сивобэк": "Злой волк",
    "Барти Крауч-младший": "Царевич-оборотень",
    "Тэм Реддл": "Темный колдун",
    # Зарубежные волшебники
    "Олимпия Максим": "Великанша",
    "Игорь Каркаров": "Боярин-предатель",
    "Флёр Делакур": "Прекрасная царевна",
    "Виктор Крам": "Богатырь-чужеземец",
}
